# Terraform plan for production

```
Plan: 1 to add, 0 to change, 1 to destroy
```

<details>
<summary>Terraform Plan Details</summary>

```
data.local_file.cluster_jwks: Reading...
data.local_file.cluster_jwks: Read complete after 0s [id=18a5b6f817bb4271ad0ac497502ebd65d011cc1a]
module.portfolio.google_service_account.portfolio: Refreshing state... [id=projects/prd-piny940/serviceAccounts/portfolio@prd-piny940.iam.gserviceaccount.com]
module.workload_identity_pool.google_project_service.iamcredentials: Refreshing state... [id=prd-piny940/iamcredentials.googleapis.com]
module.velero.google_service_account.velero: Refreshing state... [id=projects/prd-piny940/serviceAccounts/velero@prd-piny940.iam.gserviceaccount.com]
module.terraform.google_service_account.terraform_github_actions: Refreshing state... [id=projects/prd-piny940/serviceAccounts/terraform-github-actions@prd-piny940.iam.gserviceaccount.com]
module.velero.google_storage_bucket.velero: Refreshing state... [id=velero-cluster-backup.piny940.com]
module.clubroom.google_service_account.clubroom: Refreshing state... [id=projects/prd-piny940/serviceAccounts/clubroom@prd-piny940.iam.gserviceaccount.com]
module.workload_identity_pool.google_iam_workload_identity_pool.default: Refreshing state... [id=projects/prd-piny940/locations/global/workloadIdentityPools/pool]
module.portfolio.google_storage_bucket.portfolio: Refreshing state... [id=portfolio.piny940.com]
module.clubroom.google_storage_bucket.clubroom: Refreshing state... [id=clubroom.piny940.com]
google_storage_bucket.terraform_remote_backend: Refreshing state... [id=terraform-remote-backend.piny940.com]
module.clubroom.google_project_iam_member.clubroom_service_account_token_creator: Refreshing state... [id=prd-piny940/roles/iam.serviceAccountTokenCreator/serviceAccount:clubroom@prd-piny940.iam.gserviceaccount.com]
module.clubroom.google_project_iam_member.clubroom_storage_object_user: Refreshing state... [id=prd-piny940/roles/storage.objectUser/serviceAccount:clubroom@prd-piny940.iam.gserviceaccount.com]
module.terraform.google_project_iam_member.terraform_github_actions_workload_identity_user: Refreshing state... [id=prd-piny940/roles/iam.workloadIdentityUser/serviceAccount:terraform-github-actions@prd-piny940.iam.gserviceaccount.com]
module.terraform.google_project_iam_member.terraform_github_actions_owner: Refreshing state... [id=prd-piny940/roles/owner/serviceAccount:terraform-github-actions@prd-piny940.iam.gserviceaccount.com]
module.velero.google_project_iam_member.velero_storage_object_user: Refreshing state... [id=prd-piny940/roles/storage.objectUser/serviceAccount:velero@prd-piny940.iam.gserviceaccount.com]
module.portfolio.google_project_iam_member.portfolio_storage_object_user: Refreshing state... [id=prd-piny940/roles/storage.objectUser/serviceAccount:portfolio@prd-piny940.iam.gserviceaccount.com]
module.portfolio.google_project_iam_member.portfolio_service_account_token_creator: Refreshing state... [id=prd-piny940/roles/iam.serviceAccountTokenCreator/serviceAccount:portfolio@prd-piny940.iam.gserviceaccount.com]
module.kube_workload_identity.google_iam_workload_identity_pool_provider.home_kubernetes: Refreshing state... [id=projects/prd-piny940/locations/global/workloadIdentityPools/pool/providers/home-kubernetes]
module.clubroom.google_service_account_iam_member.ksa_workload_identity_user: Refreshing state... [id=projects/prd-piny940/serviceAccounts/clubroom@prd-piny940.iam.gserviceaccount.com/roles/iam.workloadIdentityUser/principal://iam.googleapis.com/projects/1056391010239/locations/global/workloadIdentityPools/pool/subject/system:serviceaccount:default:clubroom]
module.portfolio.google_service_account_iam_member.ksa_workload_identity_user: Refreshing state... [id=projects/prd-piny940/serviceAccounts/portfolio@prd-piny940.iam.gserviceaccount.com/roles/iam.workloadIdentityUser/principal://iam.googleapis.com/projects/1056391010239/locations/global/workloadIdentityPools/pool/subject/system:serviceaccount:default:portfolio]
module.terraform.google_service_account_iam_member.terraform_github_actions_pull_request_workload_identity_user: Refreshing state... [id=projects/prd-piny940/serviceAccounts/terraform-github-actions@prd-piny940.iam.gserviceaccount.com/roles/iam.workloadIdentityUser/principal://iam.googleapis.com/projects/1056391010239/locations/global/workloadIdentityPools/pool/subject/repo:piny940/infra:pull_request]
module.terraform.google_service_account_iam_member.terraform_github_actions_main_workload_identity_user: Refreshing state... [id=projects/prd-piny940/serviceAccounts/terraform-github-actions@prd-piny940.iam.gserviceaccount.com/roles/iam.workloadIdentityUser/principal://iam.googleapis.com/projects/1056391010239/locations/global/workloadIdentityPools/pool/subject/repo:piny940/infra:ref:refs/heads/main]
module.terraform.google_iam_workload_identity_pool_provider.repo_github_actions: Refreshing state... [id=projects/prd-piny940/locations/global/workloadIdentityPools/pool/providers/repo-github-actions]
module.terraform.google_service_account_iam_member.terraform_github_actions_env_workload_identity_user: Refreshing state... [id=projects/prd-piny940/serviceAccounts/terraform-github-actions@prd-piny940.iam.gserviceaccount.com/roles/iam.workloadIdentityUser/principal://iam.googleapis.com/projects/1056391010239/locations/global/workloadIdentityPools/pool/subject/repo:piny940/infra:environment:production]
module.portfolio.google_storage_bucket_iam_member.portfolio_public_access: Refreshing state... [id=b/portfolio.piny940.com/roles/storage.objectViewer/allUsers]

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
-/+ destroy and then create replacement

Terraform will perform the following actions:

  # module.velero.google_storage_bucket.velero must be replaced
-/+ resource "google_storage_bucket" "velero" {
      - default_event_based_hold    = false -> null
      - enable_object_retention     = false -> null
      ~ id                          = "velero-cluster-backup.piny940.com" -> (known after apply)
      - labels                      = {} -> null
      ~ name                        = "velero-cluster-backup.piny940.com" -> "velero-backup.piny940.com" # forces replacement
      ~ project                     = "prd-piny940" -> (known after apply)
      ~ project_number              = 1056391010239 -> (known after apply)
      - requester_pays              = false -> null
      + rpo                         = (known after apply)
      ~ self_link                   = "https://www.googleapis.com/storage/v1/b/velero-cluster-backup.piny940.com" -> (known after apply)
      ~ storage_class               = "NEARLINE" -> "STANDARD"
      ~ url                         = "gs://velero-cluster-backup.piny940.com" -> (known after apply)
        # (6 unchanged attributes hidden)

      ~ soft_delete_policy (known after apply)
      - soft_delete_policy {
          - effective_time             = "2024-10-12T14:23:36.513Z" -> null
          - retention_duration_seconds = 604800 -> null
        }

      ~ versioning (known after apply)

      ~ website (known after apply)
    }

Plan: 1 to add, 0 to change, 1 to destroy.

─────────────────────────────────────────────────────────────────────────────

Note: You didn't use the -out option to save this plan, so Terraform can't
guarantee to take exactly these actions if you run "terraform apply" now.
```

</details>
<!-- Sticky Pull Request CommentGCP Plan for production -->